#+TITLE: Data management procedures for synthesis and integration of heterogeneous datasets
#+AUTHOR: Ivan Hanigan
#+email: ivan.hanigan@anu.edu.au
#+LaTeX_CLASS: article
#+LaTeX_CLASS_OPTIONS: [a4paper]
#+LATEX: \tableofcontents
-----

* Run the Rmd
#+begin_src R :session *R* :tangle no :exports none :eval yes :padline yes
  
  # func
  setwd("~/projects/swish-dmp/report_swish_data_management_procedures")
  library(rmarkdown)
  library(knitr)
  library(knitcitations)
  library(bibtex)
  cleanbib()
  # rm("bib")
  #options("cite_format"="pandoc")
  cite_options(citation_format = "pandoc", check.entries=FALSE)
  
  #rmarkdown::render("swish-dmp-procedures.Rmd", "html_document")  
  rmarkdown::render("swish-dmp-procedures.Rmd", "pdf_document")
  # browseURL("swish-dmp-procedures.pdf")
  # browseURL("swish-dmp-procedures.html")
#+end_src  

#+RESULTS:
: /home/ivan_hanigan/projects/swish-dmp/report_swish_data_management_procedures/swish-dmp-procedures.pdf

* COMMENT go-tex
#+name:go
#+begin_src R :session *R* :tangle no :exports none :eval yes
  #### name:go ####
  setwd("~/projects/swish-dmp/report_swish_data_management_procedures")
  system("pdflatex swish-dmp-procedures.tex")
  system("pdflatex swish-dmp-procedures.tex")
  #browseURL("swish-dmp-procedures.pdf")
#+end_src

#+RESULTS: go
: 1

